ViniciusTxc3/Control_Slip_prosthesis_STM32F7/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define USER_SW_Pin GPIO_PIN_13
#define USER_SW_GPIO_Port GPIOC
#define USER_SW_EXTI_IRQn EXTI15_10_IRQn
#define USER_LED_ARD_Pin GPIO_PIN_5
#define USER_LED_ARD_GPIO_Port GPIOA
#define USER_LED_GREEn_Pin GPIO_PIN_0
#define USER_LED_GREEn_GPIO_Port GPIOB
#define FFC5_C1_Pin GPIO_PIN_13
#define FFC5_C1_GPIO_Port GPIOF
#define FFC5_C4_Pin GPIO_PIN_14
#define FFC5_C4_GPIO_Port GPIOF
#define FFC5_C2_Pin GPIO_PIN_9
#define FFC5_C2_GPIO_Port GPIOE
#define FFC5_C3_Pin GPIO_PIN_11
#define FFC5_C3_GPIO_Port GPIOE
#define USER_LED_RED_Pin GPIO_PIN_14
#define USER_LED_RED_GPIO_Port GPIOB
#define BB_ChA_Pin GPIO_PIN_14
#define BB_ChA_GPIO_Port GPIOD
#define BB_ChB_Pin GPIO_PIN_15
#define BB_ChB_GPIO_Port GPIOD
#define USER_LED_BLUE_Pin GPIO_PIN_7
#define USER_LED_BLUE_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
